Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLink.LoadFrom(Autodesk.Revit.DB.ExternalResourceReference)
Reloads the ExtendedPropertiesLink with the latest information from the server using the specified ExternalResourceReference.
externalReference:
The location of the extended properties.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The ExternalResourceReference (externalReference) is not in a format
that is supported by its server.
-or-
The given externalReference does not refer to a server that supports extended properties.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ExtendedPropertiesLink does not contain an external resource reference compatible with the ExternalResourceType.
-or-
The document does not support extended properties links.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ExtendedPropertiesLink is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ExtendedPropertiesLink is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ExtendedPropertiesLink has no open transaction.
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLink.Reload
Reloads the linked extended properties with the latest information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The server referenced by the stored ExternalResourceReference does not exist or does not implement IExternalResourceServer.
-or-
The stored ExternalResourceReference is not in a format that is supported by its server.
-or-
The stored ExternalResourceReference is not supported by the external server associated with this link.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ExtendedPropertiesLink does not contain an external resource reference compatible with the ExternalResourceType.
-or-
The document does not support extended properties links.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ExtendedPropertiesLink is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ExtendedPropertiesLink is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ExtendedPropertiesLink has no open transaction.
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLink.GetAllAssociatedPropertyIds
Retrieves all ids, each corresponding to a Autodesk::Revit::DB::ExternalData::ExtendedParameterElement associated with this link.
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLink.CreateFromCloudDataset(Autodesk.Revit.DB.Document,System.String)
Creates the ExtendedPropertiesLink in the given document from a cloud dataset.
doc:
Document which will gain an ExtendedPropertiesLink.
The document must correspond to a cloud model.
datasetId:
The id of the dataset in Autodesk Construction Cloud; it should be hosted in the same project as the document.
A valid dataset id should start with "urn:WIPENVIRONMENT:dm.lineage:", followed by an unique identifier.
The WIPENVIRONMENT varies from Region to Region.
An example of a valid dataset id for an account created in the US Region would be urn:adsk.wipprod:dm.lineage:AoV26TGqRjuNs4ANq84ncQ.
Returns:
Information about the ExtendedPropertiesLink.
Throws Autodesk.Revit.Exceptions.ArgumentException:
doc is a not cloud model, cannot execute this operation.
-or-
The document must be a cloud model with a valid project id.
-or-
The document does not support extended properties links.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The extended properties server does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLink.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceReference)
Creates the ExtendedPropertiesLink in the given document.
doc:
Document which will gain an ExtendedPropertiesLink.
externalReference:
Reference to external information containing extended properties.
Returns:
Information about the ExtendedPropertiesLink.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The ExternalResourceReference (externalReference) is not in a format
that is supported by its server.
-or-
The given externalReference does not refer to a server that supports extended properties.
-or-
The document does not support extended properties links.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLink
Represents a collection of extended properties linked to a Revit model.
Since:
2027